glm-disagg/results/old-qps/1p1d_8/result_qps12.txt

==============================================
Discovering GLM-Disagg Pods in namespace: raj-network-debug
==============================================
  Decode pod:   ms-glm-disagg-llm-d-modelservice-decode-668957bdbf-6bf9g
  Decode log:   results/decode_qps12.log
  Prefill pod:  ms-glm-disagg-llm-d-modelservice-prefill-98c457f87-fc9zc
  Prefill log:  results/prefill_qps12.log

Starting decode pod log capture to results/decode_qps12.log ...
Starting prefill pod log capture to results/prefill_qps12.log ...

==============================================
Running QPS Sweep via Poker Pod (timeout: 900s)
==============================================

Running: just TARGET_DURATION=30 MIN_PROMPTS=120 sweep-qps glm-disagg 4096 256 12

#!/usr/bin/env bash
URL=$(just _url glm-disagg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-disagg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
SWEEP_QPS_START
CONFIG: target=glm-disagg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=8
TARGET_DURATION: 30s  MIN_PROMPTS: 120
REQUEST_RATE: 12 req/s (Poisson)  NUM_PROMPTS: 360

BENCH_RUN: request_rate=12 num_prompts=360
INFO 02-25 23:58:30 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-25 23:58:30 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-25 23:58:30 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-25 23:58:33 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fde4da4ad40>, seed=58235827, num_prompts=360, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-disagg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=12.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9cbc6f28-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-25 23:58:35 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/360 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 360/360 [02:33<00:00,  2.35it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     360       
Failed requests:                         0         
Request rate configured (RPS):           12.00     
Benchmark duration (s):                  153.39    
Total input tokens:                      1474200   
Total generated tokens:                  92160     
Request throughput (req/s):              2.35      
Output token throughput (tok/s):         600.83    
Peak output token throughput (tok/s):    653.00    
Peak concurrent requests:                301.00    
Total token throughput (tok/s):          10211.70  
---------------Time to First Token----------------
Mean TTFT (ms):                          60437.53  
Median TTFT (ms):                        60811.30  
P99 TTFT (ms):                           118765.03 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          16.07     
Median TPOT (ms):                        16.09     
P99 TPOT (ms):                           16.22     
---------------Inter-token Latency----------------
Mean ITL (ms):                           16.07     
Median ITL (ms):                         16.05     
P99 ITL (ms):                            21.82     
==================================================
BENCH_RUN_END: request_rate=12

SWEEP_QPS_END

==============================================
Sweep Completed (exit 0)
==============================================

Stopping log captures...
Decode log:  results/decode_qps12.log (33 lines, 12K)
Prefill log: results/prefill_qps12.log (376 lines, 64K)